# Ln

## Description
Function Ln returns the natural logarithm of the specified value.

```pascal
FUNCTION Ln(v : REAL): REAL;
```

```python
def vs.Ln(v):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|v|REAL|Numeric value for which to find the natural logarithm.|

## Version
Availability: from All Versions

## Category
* Math - General